# player_id : skin
PLAYER_SKINS = {
    0 : {
        0: "  ",  # Пустое пространство
        1: "🌟",  # Змея
        2: "🍔",  # Еда
        3: " │ ",  # Вертикальная стена
        4: "──"  # Горизонтальная стена
    },
    1 : {
        0: "  ",  # Пустое пространство
        1: "🚕",  # Змея
        2: "🍕",  # Еда
        3: " │ ",  # Вертикальная стена
        4: "──"  # Горизонтальная стена
    }
}

CORNERS = {
    "top_left": " ┌─",
    "top_right": "─┐ ",
    "bottom_left": " └─",
    "bottom_right": "─┘ "
}

# player_id : keymap
KEYMAPS = {
    0 : {
        "w" : "up",
        "s" : "down",
        "a" : "left",
        "d" : "right",
    },
    1 : {
        "i": "up",
        "k": "down",
        "j": "left",
        "l": "right",
    }
}

DEFAULT_ROWS = 10
DEFAULT_COLUMNS = 15
SPEED = 2